a=list(range(1,11))#a=[1,2,3,4,5,6,7,8,9,10]
print(a)
'''print(a[:])  #获取整个列表的元素
print(a[:1]) #获取索引为0的元素
print(a[:3]) #获取索引为0-2的元素
print(a[2:3])#获取索引为2的元素
print(a[1:7])#获取索引为1-6的元素
print(a[::2])#获取列表中每两个元素取一个
print(a[1::2])#获取从索引为1开始间隔取元素
print(a[1:-1])#掐头去尾'''
#切片的应用，用于同时对列表中多个元素进行更改
#第一种情况，连续的元素列表
a[9:11]=['切片操作真神奇！',100]
print(a)
a[:4]=['切片']
print(a)
a[:]=['元素全删']
print(a)
#第二种不连续元素列表，切片赋值一定要元素数量要对等
b=[20,21,22,23,24,25,26,27,28,29,30]
print(b[::2])#[20,22,24,26,28,30]
b[::2]=[0,0,0,0,0,0]
print(b)
b[1::2]=['太','不','容','易','了']
#也可以通过切片在指定位置插入多个元素
c=list('南昌工学院')
c[1:1]=[1,2,3,4,5,6]
print(c)
